"use strict";

// Отслеживание изменения ориентации экрана:
// Напишите код, который отслеживает изменение ориентации экрана устройства
// (с портретной на ландшафтную и наоборот) и выводит сообщение об этом на веб-странице.

const text = document.querySelector(".task1");

window.addEventListener("resize", () => {
  text.textContent =
    window.innerWidth > window.innerHeight
      ? "ландшафтная ориентация"
      : "портретная ориентация";
});

// Предупреждение о несохраненных данных:
// Создайте веб-форму с текстовым полем. Реализуйте функционал,
// при котором при попытке закрыть вкладку браузера появляется диалоговое окно с
// предупреждением о возможности потери введенных, но несохраненных данных.

window.onbeforeunload = function() {
  return "Данные не сохранены. Точно перейти?";
};